trade/src/Documents/ЗапросОстатковПартийЗЕРНО/ЗапросОстатковПартийЗЕРНО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросОстатковПартийЗЕРНО</name>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПартийЗЕРНО</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ВидыОперацийЗЕРНО</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукцииИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецПартии</name>
    <type>
      <types>DefinedType.ОрганизацияКонтрагентГосИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеВладельцаПартии</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Элеватор</name>
    <type>
      <types>DefinedType.ОрганизацияКонтрагентГосИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеЭлеватора</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеЗапросОстатковПартийЗЕРНО</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОстаткиПоДаннымЗЕРНО</name>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.РеестрПартийЗЕРНО</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗЕРНО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КорректировкаОстатков</name>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.РеестрПартийЗЕРНО</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗЕРНО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВОбработкеЗЕРНО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade/src/InformationRegisters/СтатусыОбъектовСинхронизацииЗЕРНО/СтатусыОбъектовСинхронизацииЗЕРНО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыОбъектовСинхронизацииЗЕРНО</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбработкиЗапросаОстатковПартийЗЕРНО</types>
      <types>EnumRef.СтатусыОбработкиОформлениеСДИЗЗЕРНО</types>
      <types>EnumRef.СтатусыОбработкиМестФормированияПартийЗЕРНО</types>
      <types>EnumRef.СтатусыОбработкиФормированиеПартийЗЕРНО</types>
      <types>EnumRef.СтатусыОбработкиВнесениеСведенийОСобранномУрожаеЗЕРНО</types>
      <types>EnumRef.СтатусыОбработкиПогашенияСДИЗЗЕРНО</types>
      <types>EnumRef.СтатусыОбработкиСписанияПартииЗЕРНО</types>
      <types>EnumRef.СтатусыОбработкиСообщенийЗЕРНО</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие1</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюЗЕРНО</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие2</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюЗЕРНО</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие3</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюЗЕРНО</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектСинхронизации</name>
    <type>
      <types>DefinedType.ОбъектыСинхронизацииЗЕРНО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/Enums/ВидыПродукцииИС/ВидыПродукцииИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПродукцииИС</name>
  <enumValues>
    <name>Алкогольная</name>
  </enumValues>
  <enumValues>
    <name>Табак</name>
  </enumValues>
  <enumValues>
    <name>Обувь</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>Фотоаппараты</name>
  </enumValues>
  <enumValues>
    <name>Духи</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>КреслаКоляски</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабак</name>
  </enumValues>
  <enumValues>
    <name>УпакованнаяВода</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>Антисептики</name>
  </enumValues>
  <enumValues>
    <name>БАДы</name>
  </enumValues>
  <enumValues>
    <name>НикотиносодержащаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>Пиво</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияИзНатуральногоМеха</name>
  </enumValues>
  <enumValues>
    <name>Зерно</name>
  </enumValues>
  <enumValues>
    <name>ПродуктыПереработкиЗерна</name>
  </enumValues>
  <enumValues>
    <name>СоковаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>БезалкогольноеПиво</name>
  </enumValues>
  <enumValues>
    <name>ПодконтрольнаяПродукцияВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>МорепродуктыПодконтрольныеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПодконтрольнаяПродукцияСАТУРН</name>
  </enumValues>
  <enumValues>
    <name>ЗерноВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПродуктыПереработкиЗернаВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхПодконтрольныеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>МясоПодконтрольноеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ВетеринарныеПрепараты</name>
  </enumValues>
  <enumValues>
    <name>ИгрыИИгрушкиДляДетей</name>
  </enumValues>
  <enumValues>
    <name>РадиоэлектроннаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ТитановаяМеталлопродукция</name>
  </enumValues>
  <enumValues>
    <name>КонсервированнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>РастительныеМасла</name>
  </enumValues>
  <enumValues>
    <name>ОптоволокноИОптоволоконнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ПарфюмерныеИКосметическиеСредстваИБытоваяХимия</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>КонсервированнаяПродукцияБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПечатнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>СтроительныеМатериалы</name>
  </enumValues>
  <enumValues>
    <name>ОтопительныеПриборы</name>
  </enumValues>
  <enumValues>
    <name>Бакалея</name>
  </enumValues>
  <enumValues>
    <name>АлкогольнаяПродукцияДо9Процентов</name>
  </enumValues>
  <enumValues>
    <name>ТелефоныИНоутбуки</name>
  </enumValues>
  <enumValues>
    <name>ПиротехническиеИзделияИСредстваПожарнойБезопасности</name>
  </enumValues>
  <enumValues>
    <name>КабельнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>МоторныеМасла</name>
  </enumValues>
  <enumValues>
    <name>БезалкогольныеНапитки</name>
  </enumValues>
  <enumValues>
    <name>ПивоВПотребительскихУпаковках</name>
  </enumValues>
  <enumValues>
    <name>ТехническиеСредстваРеабилитации</name>
  </enumValues>
  <enumValues>
    <name>МедицинскиеИзделия</name>
  </enumValues>
  <enumValues>
    <name>МедицинскиеИзделия20</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность2025</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхВлажныеПодконтрольныеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхВлажныеБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПолимерныеТрубы</name>
  </enumValues>
  <enumValues>
    <name>СладостиИКондитерскиеИзделия</name>
  </enumValues>
  <enumValues>
    <name>ПечатныеПлаты</name>
  </enumValues>
  <enumValues>
    <name>ДезинфицирующиеСредства</name>
  </enumValues>
  <enumValues>
    <name>БАДы2025</name>
  </enumValues>
  <enumValues>
    <name>АвтозапчастиИКомплектующиеТранспортныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СпортивноеПитание</name>
  </enumValues>
  <enumValues>
    <name>РастворимыеЗавариваемыеНапитки</name>
  </enumValues>
  <enumValues>
    <name>ТоварыЛичнойГигиены</name>
  </enumValues>
  <enumValues>
    <name>БритвыИЛезвия</name>
  </enumValues>
  <enumValues>
    <name>НапиткиССодержаниемМолокаКакаоПрочие</name>
  </enumValues>
</mdclass:Enum>

trade/src/Enums/ВидыОперацийЗЕРНО/ВидыОперацийЗЕРНО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийЗЕРНО</name>
  <enumValues>
    <name>АннулированиеПартииПриКорректировке</name>
  </enumValues>
  <enumValues>
    <name>АннулированиеСДИЗ</name>
  </enumValues>
  <enumValues>
    <name>АннулированиеСДИЗПартииРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>АннулированиеСДИЗПриКорректировке</name>
  </enumValues>
  <enumValues>
    <name>АннулированиеСДИЗРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>АннулированиеСписанияПартии</name>
  </enumValues>
  <enumValues>
    <name>АннулированиеФормированияПартии</name>
  </enumValues>
  <enumValues>
    <name>АннулированиеФормированияПартииРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ВнесениеСведенийОСобранномУрожае</name>
  </enumValues>
  <enumValues>
    <name>ВнесениеСведенийОСобранномУрожаеАннулирование</name>
  </enumValues>
  <enumValues>
    <name>ВнесениеСведенийОСобранномУрожаеРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаОстатковПартий</name>
  </enumValues>
  <enumValues>
    <name>ЗапросКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>ЗапросКлассификатораАбстрактнаяОперация</name>
  </enumValues>
  <enumValues>
    <name>ЗапросМестФормированияПартий</name>
  </enumValues>
  <enumValues>
    <name>ЗапросМестФормированияПартийАбстрактнаяОперация</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтказовПогашенийСДИЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПартий</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПартийНаХранении</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПартийРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПогашенийСДИЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросРеестраЭлеваторов</name>
  </enumValues>
  <enumValues>
    <name>ЗапросРезультатовИсследований</name>
  </enumValues>
  <enumValues>
    <name>ЗапросРезультатовИсследованийАбстрактнаяОперация</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСДИЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСДИЗАбстрактнаяОперация</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаПогашенияСДИЗРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>МестоФормированияПартииРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>МестоФормированияПартииСоздание</name>
  </enumValues>
  <enumValues>
    <name>МестоФормированияПартииУдаление</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеКорректировкиСДИЗРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеКорректировкиСДИЗРасчетСтатусаПоСтроке</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗ</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатусаПоСтроке</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗИмпорт</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗКорректировочный</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗКорректировочныйРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗОтказПогашенияСДИЗ</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗОтказПогашенияСДИЗПриКорректировке</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗОтказПогашенияСДИЗРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗРФ</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗЭлеватор</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСДИЗ</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСДИЗАннулирование</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСДИЗАннулированиеРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСДИЗРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>СписаниеПартии</name>
  </enumValues>
  <enumValues>
    <name>СписаниеПартиийРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПартии</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПартииИзДругихПартий</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПартииИзОстатков</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПартииИмпорт</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПартииНаОсновеБумажногоСДИЗ</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПартииПоРезультатамГосмониторинга</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПартииПриСбореУрожая</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПартииПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПартииРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>МестоФормированияПартииИзменениеСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ЗапросАктовОтбораПроб</name>
  </enumValues>
  <enumValues>
    <name>ЗапросАктовОтбораПробАбстрактнаяОперация</name>
  </enumValues>
</mdclass:Enum>

trade/src/Documents/ЗапросОстатковПартийЗЕРНО/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ИнтеграцияИС.НастроитьВидимостьДокументаОснования(ЭтотОбъект);
	Элементы.ДокументОснование.ДоступныеТипы = Метаданные.ОпределяемыеТипы.ОснованиеЗапросОстатковПартийЗЕРНО.Тип;
	
	ЗаполнитьДоступныеВидыПродукции();
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыИС.ПриСозданииНаСервере(ЭтотОбъект);
	
	СобытияФормИСПереопределяемый.УстановитьСвязиПараметровВыбораСНоменклатурой(
		ЭтотОбъект, "ОстаткиПоДаннымЗЕРНОХарактеристика", "Элементы.ОстаткиПоДаннымЗЕРНО.ТекущиеДанные.Номенклатура");
	СобытияФормИСПереопределяемый.УстановитьСвязиПараметровВыбораСНоменклатурой(
		ЭтотОбъект, "ОстаткиПоДаннымЗЕРНОСерия", "Элементы.ОстаткиПоДаннымЗЕРНО.ТекущиеДанные.Номенклатура");
	СобытияФормИСПереопределяемый.УстановитьСвязиПараметровВыбораСХарактеристикой(
		ЭтотОбъект, "ОстаткиПоДаннымЗЕРНОСерия", "Элементы.ОстаткиПоДаннымЗЕРНО.ТекущиеДанные.Характеристика");
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриСозданииЧтенииНаСервере();
		ИнтеграцияИСПереопределяемый.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	КонецЕсли;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриСозданииЧтенииНаСервере();
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ИнтеграцияИСКлиент.ПослеЗаписиВФормеОбъектаДокументаИС(
		ЭтотОбъект,
		Объект,
		ИнтеграцияЗЕРНОКлиентСервер.ИмяПодсистемы(),
		ПараметрыЗаписи);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриСозданииЧтенииНаСервере();
	
	НастроитьЗависимыеЭлементыФормы(ЭтотОбъект);
	
	РазблокироватьДанныеФормыДляРедактирования();
	
	ИнтеграцияИС.ПослеЗаписиНаСервереВФормеОбъектаДокументаИС(
		ЭтотОбъект,
		ТекущийОбъект,
		ИнтеграцияЗЕРНОКлиентСервер.ИмяПодсистемы(),
		ПараметрыЗаписи);
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	СобытияФормЗЕРНОКлиентПереопределяемый.ОбработкаВыбораСерии(
		ЭтотОбъект, ВыбранноеЗначение, ИсточникВыбора, ПараметрыУказанияСерий);
	
	СобытияФормЗЕРНОКлиентПереопределяемый.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ИсточникВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = ОбменДаннымиИСКлиентСервер.ИмяСобытияИзмененоСостояние(ИнтеграцияЗЕРНОКлиентСервер.ИмяПодсистемы())
		И Параметр.Ссылка = Объект.Ссылка Тогда
		
		Если Параметр.Свойство("ОбъектИзменен")
			И Параметр.ОбъектИзменен Тогда
			ОбновитьПредставленияНаФорме(Истина);
		Иначе
			ОбновитьПредставленияНаФорме(Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = ОбменДаннымиИСКлиентСервер.ИмяСобытияВыполненОбмен(ИнтеграцияЗЕРНОКлиентСервер.ИмяПодсистемы())
	 И (Параметр = Неопределено
		Или (ТипЗнч(Параметр) = Тип("Структура") И Параметр.ОбновлятьСтатусВФормахДокументов)) Тогда
		
		ОбновитьПредставленияНаФорме(Истина);
		
	КонецЕсли;
	
	// РаботаСПолямимСоставногоТипа
	Если ВРег(Лев(ИмяСобытия, 6)) = "ЗАПИСЬ" Тогда
		СобытияФормИСКлиент.ПолеСоставногоТипаОбработатьИзменениеДанных(ЭтотОбъект, Источник);
	КонецЕсли;
	// Конец РаботаСПолямимСоставногоТипа
	
	ОбщегоНазначенияСобытияФормИСКлиентПереопределяемый.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СобытияФормИСКлиент.ОбработкаНавигационнойСсылки(ЭтотОбъект, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ОбщегоНазначенияСобытияФормИСКлиентПереопределяемый.ПередЗаписью(ЭтотОбъект, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьЗаписатьПараметрыОбновленияСтатуса(Отказ, ТекущийОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусЗЕРНОПредставлениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	Если (Не ЗначениеЗаполнено(Объект.Ссылка)) Или (Не Объект.Проведен) Тогда
		
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения(
			"СтатусПредставлениеОбработкаНавигационнойСсылкиЗавершение",
			ЭтотОбъект,
			Новый Структура("НавигационнаяСсылкаФорматированнойСтроки", НавигационнаяСсылкаФорматированнойСтроки));
		ТекстВопроса = НСтр("ru = 'Документ ""Запрос остатков партий"" не проведен. Провести?'");
		ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	ИначеЕсли Модифицированность Тогда
		
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения(
			"СтатусПредставлениеОбработкаНавигационнойСсылкиЗавершение",
			ЭтотОбъект,
			Новый Структура("НавигационнаяСсылкаФорматированнойСтроки", НавигационнаяСсылкаФорматированнойСтроки));
		ТекстВопроса = НСтр("ru = 'Документ ""Запрос остатков партий"" был изменен. Провести?'");
		ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ОбработатьНажатиеНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	НастроитьЗависимыеЭлементыФормы(ЭтотОбъект, "Организация");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	НастроитьЗависимыеЭлементыФормы(ЭтотОбъект, "Подразделение");
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииПриИзменении(Элемент)
	
	Если Объект.ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Зерно") Тогда
		Объект.Элеватор       = Неопределено;
		Объект.ВладелецПартии = Неопределено;
		Объект.Операция       = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПартий");
	КонецЕсли;
	
	ИнтеграцияЗЕРНОКлиентСервер.УстановитьПараметрыВыбораНоменклатуры(
		ЭтотОбъект, Объект.ВидПродукции, "ОстаткиПоДаннымЗЕРНОНоменклатура");
		
	НастроитьЗависимыеЭлементыФормы(ЭтотОбъект, "ВидПродукции");
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлеваторСтрокойПриИзменении(Элемент)
	
	ПолеСоставногоТипаПриИзменении(Элемент);
	ОпределитьТипОрганизацияКонтрагент(ТипЭлеватора, Объект.Элеватор);
	НастроитьЗависимыеЭлементыФормы(ЭтотОбъект, "Подразделение");
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлеваторСтрокойОткрытие(Элемент, СтандартнаяОбработка)
	ПолеСоставногоТипаОткрытие(Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЭлеваторСтрокойОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПолеСоставногоТипаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	ОпределитьТипОрганизацияКонтрагент(ТипЭлеватора, Объект.Элеватор);
	НастроитьЗависимыеЭлементыФормы(ЭтотОбъект, "Подразделение");

КонецПроцедуры

&НаКлиенте
Процедура ЭлеваторСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПолеСоставногоТипаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЭлеваторСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПолеСоставногоТипаАвтоПодбор(Элемент, Элемент.ТекстРедактирования, ДанныеВыбора, Неопределено, 0, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПартииСтрокойПриИзменении(Элемент)
	
	ПолеСоставногоТипаПриИзменении(Элемент);
	ОпределитьТипОрганизацияКонтрагент(ТипВладельцаПартии, Объект.ВладелецПартии);
	НастроитьЗависимыеЭлементыФормы(ЭтотОбъект, "Подразделение");
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПартииСтрокойОткрытие(Элемент, СтандартнаяОбработка)
	ПолеСоставногоТипаОткрытие(Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПартииСтрокойОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПолеСоставногоТипаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	ОпределитьТипОрганизацияКонтрагент(ТипВладельцаПартии, Объект.ВладелецПартии);
	НастроитьЗависимыеЭлементыФормы(ЭтотОбъект, "Подразделение");

КонецПроцедуры

&НаКлиенте
Процедура ВладелецПартииСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПолеСоставногоТипаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПартииСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПолеСоставногоТипаАвтоПодбор(Элемент, Элемент.ТекстРедактирования, ДанныеВыбора, Неопределено, 0, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОперацияПриИзменении(Элемент)
	
	НастроитьЗависимыеЭлементыФормы(ЭтотОбъект, "Операция");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОстаткиПоДаннымЗЕРНО

&НаКлиенте
Процедура ОстаткиПоДаннымЗЕРНОПередУдалением(Элемент, Отказ)
	
	Если РедактированиеФормыНедоступно Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПоДаннымЗЕРНОНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СобытияФормЗЕРНОКлиент.ПриНачалеВыбораНоменклатуры(Элемент, Объект.ВидПродукции, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПоДаннымЗЕРНОНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОстаткиПоДаннымЗЕРНО.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СобытияФормЗЕРНОКлиентПереопределяемый.ПриИзмененииНоменклатуры(
		ЭтотОбъект, ТекущиеДанные, КэшированныеЗначения, ПараметрыУказанияСерий);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПоДаннымЗЕРНОХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОстаткиПоДаннымЗЕРНО.ТекущиеДанные;
	СобытияФормЗЕРНОКлиентПереопределяемый.ПриНачалеВыбораХарактеристики(
		Элемент, ТекущиеДанные, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПоДаннымЗЕРНОХарактеристикаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОстаткиПоДаннымЗЕРНО.ТекущиеДанные;
	СобытияФормЗЕРНОКлиентПереопределяемый.ПриИзмененииХарактеристики(ЭтотОбъект, ТекущиеДанные, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПоДаннымЗЕРНОСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИнтеграцияИСКлиент.ОткрытьПодборСерий(ЭтотОбъект,, Элемент.ТекстРедактирования, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПоДаннымЗЕРНОСерияПриИзменении(Элемент)
	
	СобытияФормЗЕРНОКлиентПереопределяемый.ПриИзмененииСерии(
		ЭтотОбъект, Элементы.ОстаткиПоДаннымЗЕРНО.ТекущиеДанные, КэшированныеЗначения, ПараметрыУказанияСерий);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПоДаннымЗЕРНОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = Неопределено
		Или Не (Поле.Имя = Элементы.ОстаткиПоДаннымЗЕРНОПартия.Имя
			Или Поле.Имя = Элементы.ОстаткиПоДаннымЗЕРНОПартияИдентификатор.Имя) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Объект.ОстаткиПоДаннымЗЕРНО.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ПоказатьЗначение(, ДанныеСтроки.Партия);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ЗапросОстатковПартийЗЕРНО.Форма.ФормаДокумента.Провести",,Истина);
	
	ОчиститьСообщения();
	ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	Записать(ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ЗапросОстатковПартийЗЕРНО.Форма.ФормаДокумента.Записать",,Истина);
	
	ОчиститьСообщения();
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ЗапросОстатковПартийЗЕРНО.Форма.ФормаДокумента.ПровестиИЗакрыть",,Истина);
	
	ОчиститьСообщения();
	ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	Если Записать(ПараметрыЗаписи) Тогда
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АрхивироватьДокумент(Команда)
	
	ОбщегоНазначенияИСКлиент.АрхивироватьДокументы(ЭтотОбъект, Объект.Ссылка, ИнтеграцияЗЕРНОКлиент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоРасхождениям(Команда)
	
	ОчиститьСообщения();
	ЗаполнитьПоРасхождениямНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НеСниматьРезервы(Команда)
	НеСниматьРезервыСервер();
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьНоменклатуру(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПриЗавершенииСопоставленияНоменклатурыСтрок", ЭтотОбъект);
	ИнтеграцияИСКлиент.ОткрытьФормуУказанияНоменклатуры(
		ЭтотОбъект, ОповещениеОЗавершении, ИнтеграцияЗЕРНОКлиентСервер.РасширенныеВидыПродукции(Объект.ВидПродукции));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	СобытияФормИСПереопределяемый.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
		ЭтотОбъект, "ОстаткиПоДаннымЗЕРНОХарактеристика", "Объект.ОстаткиПоДаннымЗЕРНО.ХарактеристикиИспользуются");
	СобытияФормИСПереопределяемый.УстановитьУсловноеОформлениеСерийНоменклатуры(
		ЭтотОбъект, "ОстаткиПоДаннымЗЕРНОСерия", "Объект.ОстаткиПоДаннымЗЕРНО.СтатусУказанияСерий", "Объект.ОстаткиПоДаннымЗЕРНО.ТипНоменклатуры");
	
	СобытияФормЗЕРНО.УстановитьУсловноеОформлениеОКПД2(ЭтотОбъект, "ОстаткиПоДаннымЗЕРНОПартияОКПД2", "Объект.ОстаткиПоДаннымЗЕРНО.ОКПД2Представление");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	ИнтеграцияЗЕРНО.УстановитьДоступностьПоляСтатус(ЭтотОбъект);
	
	ЦветГиперссылки = ЦветаСтиля.ЦветГиперссылкиГосИС;
	
	ПравоИзменения = ПравоДоступа("Изменение", Метаданные.Документы.ЗапросОстатковПартийЗЕРНО);
	
	ПодразделенияИспользуются = ОбщегоНазначенияИС.ИспользоватьОбособленныеПодразделенияВыделенныеНаБаланс();
	
	ПараметрыУказанияСерий = ИнтеграцияИС.ПараметрыУказанияСерийФормыОбъекта(Объект, Документы.ЗапросОстатковПартийЗЕРНО);
	ТипВладельцаПартии = ИнтеграцияЗЕРНО.ОпределитьТипОрганизацияКонтрагент(Объект.ВладелецПартии);
	ТипЭлеватора       = ИнтеграцияЗЕРНО.ОпределитьТипОрганизацияКонтрагент(Объект.Элеватор);
	
	ЕдиницаИзмеренияКилограмм = ИнтеграцияИСКлиентСерверПовтИсп.ЕдиницаИзмеренияКилограмм();
	ЗаполнитьДоступныеОперации(ЭтотОбъект);
	
	ИнтеграцияЗЕРНОКлиентСервер.УстановитьПараметрыВыбораНоменклатуры(ЭтотОбъект, Объект.ВидПродукции, "ОстаткиПоДаннымЗЕРНОНоменклатура");
	
	Если Объект.ОстаткиПоДаннымЗЕРНО.Количество() Тогда
		ИнициализироватьСлужебныеРеквизитыТаблицыОстаткиПоДаннымЗЕРНО();
	КонецЕсли;
	
	НастроитьЗависимыеЭлементыФормы(ЭтотОбъект);
	
	// РаботаСПолямимСоставногоТипа
	СобытияФормИС.ПоляСоставногоТипаИнициализация(ЭтотОбъект, ИменаЭлементовПолейСоставногоТипа());
	// Конец РаботаСПолямимСоставногоТипа
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДоступныеОперации(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.Операция.СписокВыбора.Очистить();
	Элементы.Операция.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПартий"));
	Элементы.Операция.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПартийНаХранении"));
	Если ЗначениеЗаполнено(Форма.Объект.Операция)
		И Элементы.Операция.СписокВыбора.НайтиПоЗначению(Форма.Объект.Операция) = Неопределено Тогда
		Элементы.Операция.СписокВыбора.Добавить(Форма.Объект.Операция);
	КонецЕсли;
	Элементы.Операция.СписокВыбора.СортироватьПоПредставлению();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьЗависимыеЭлементыФормы(Форма, СписокРеквизитов = "")
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Инициализация       = ПустаяСтрока(СписокРеквизитов);
	СтруктураРеквизитов = Новый Структура(СписокРеквизитов);
	ЭтоЭлеватор         = (Объект.Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗЕРНО.ЗапросПартийНаХранении"));
	ЭтоЗерно            = (Объект.ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Зерно"));
	
	Если СтруктураРеквизитов.Свойство("Операция")
		Или СтруктураРеквизитов.Свойство("ВидПродукции")
		Или Инициализация Тогда
		
		Элементы.Операция.Видимость             = ЭтоЗерно;
		Элементы.ГруппаВладелецПартии.Видимость = ЭтоЭлеватор И ЭтоЗерно;
		Элементы.ГруппаЭлеватор.Видимость       = Не ЭтоЭлеватор И ЭтоЗерно;
		
		СтруктураРеквизитов.Вставить("Организация");
		СтруктураРеквизитов.Вставить("Подразделение");
		
	КонецЕсли;
	
	Если СтруктураРеквизитов.Свойство("Организация") Тогда
		ОбновитьПодсказкуВводаВладелецПартии(Форма);
		СтруктураРеквизитов.Вставить("Подразделение");
	КонецЕсли;
	
	Если СтруктураРеквизитов.Свойство("Подразделение") Тогда
		
		Элементы.Подразделение.Видимость                = Форма.ПодразделенияИспользуются;
		Элементы.ПодразделениеВладельцаПартии.Видимость = Форма.ПодразделенияИспользуются
			И ЭтоЭлеватор И ЭтоЗерно И (Форма.ТипВладельцаПартии = 0);
		Элементы.ПодразделениеЭлеватора.Видимость       = Форма.ПодразделенияИспользуются
			И Не ЭтоЭлеватор И ЭтоЗерно И (Форма.ТипЭлеватора = 0);
		
		ОбновитьПодсказкуВводаПодразделения(Форма);
		
	КонецЕсли;
	
	Если СтруктураРеквизитов.Свойство("СтатусЗЕРНО") Тогда
		
		РедактированиеФормыНеДоступно = Форма.СтатусЗЕРНО <> ПредопределенноеЗначение("Перечисление.СтатусыОбработкиЗапросаОстатковПартийЗЕРНО.Черновик")
			И Форма.СтатусЗЕРНО <> ПредопределенноеЗначение("Перечисление.СтатусыОбработкиЗапросаОстатковПартийЗЕРНО.Ошибка");
		
		Форма.РедактированиеФормыНеДоступно = РедактированиеФормыНеДоступно;
	
		Элементы.ГруппаНередактируемыеПослеОтправкиРеквизитыОсновное.ТолькоПросмотр = РедактированиеФормыНеДоступно;
		
	КонецЕсли;
	
	Если Инициализация Или СтруктураРеквизитов.Свойство("ОбновитьСтатусЗЕРНО") Тогда
		
		УстановитьПараметрыОбновленияСтатуса = Форма.Модифицированность И НЕ Инициализация;
		ОбновитьСтатусЗЕРНО(Форма, УстановитьПараметрыОбновленияСтатуса);
		
	КонецЕсли;
	
	Если Инициализация
		Или СтруктураРеквизитов.Свойство("СтатусЗЕРНО")
		Или СтруктураРеквизитов.Свойство("ОбновитьСтатусЗЕРНО")  Тогда
		Элементы.ТоварыСопоставитьНоменклатуру.Доступность = Форма.СтатусЗЕРНО = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиЗапросаОстатковПартийЗЕРНО.ОстаткиПартийЗагружены");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныеВидыПродукции()
	
	ВидыПродукции = ИнтеграцияЗЕРНОКлиентСерверПовтИсп.УчитываемыеВидыПродукции();
	
	Элементы.ВидПродукции.СписокВыбора.Очистить();
	Для Каждого ВидПродукции Из ВидыПродукции Цикл
		Элементы.ВидПродукции.СписокВыбора.Добавить(ВидПродукции, Строка(ВидПродукции));
	КонецЦикла;
	Элементы.ВидПродукции.СписокВыбора.СортироватьПоПредставлению();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииСопоставленияНоменклатурыСтрок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	ДанныеВыбора = Результат.ДанныеВыбора;
	
	Для Каждого СтрокаСписка Из Элементы.ОстаткиПоДаннымЗЕРНО.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.ОстаткиПоДаннымЗЕРНО.ДанныеСтроки(СтрокаСписка);
		ДанныеСтроки.Номенклатура = ДанныеВыбора.Номенклатура;
		ДанныеСтроки.Характеристика = ДанныеВыбора.Характеристика;
		ДанныеСтроки.Серия = ДанныеВыбора.Серия;
		
		СобытияФормЗЕРНОКлиентПереопределяемый.ПриИзмененииНоменклатуры(
			ЭтотОбъект, ДанныеСтроки, КэшированныеЗначения, ПараметрыУказанияСерий);
		ДанныеСтроки.Серия = ДанныеВыбора.Серия;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда) Экспорт
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды() Экспорт
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	ПодключаемыеКомандыИСКлиентСервер.УправлениеВидимостьюКомандПодключенныхКОбъекту(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ВыборОснования

&НаКлиенте
Процедура Подключаемый_ПослеВыбораОснования(ДанныеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ДанныеВыбора = Элементы.ДокументОснование.ДоступныеТипы.ПривестиЗначение(ДанныеВыбора) Тогда
		Объект.ДокументОснование = ДанныеВыбора;
		Модифицированность       = Истина;
	КонецЕсли;
	
	ЗаполнитьТовары = (ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		И ДополнительныеПараметры.Свойство("ОбработатьПерезаполнение"));
	Если ЗаполнитьТовары Тогда
		ОбработчикПерезаполненияПоОснованию();
	КонецЕсли;
	
	НастроитьЗависимыеЭлементыФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПерезаполненияПоОснованию()
	
	ОчиститьСообщения();
	
	ПерезаполнитьПоОснованиюСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоОснованиюСервер()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.Заполнить(Объект.ДокументОснование);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
	ПриСозданииЧтенииНаСервере();
	ИнтеграцияИСПереопределяемый.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Подключаемый_ПриЗавершенииОперации(Результат, ДополнительныеПараметры) Экспорт
	
	Прочитать();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставленияНаФорме(Прочитать = Ложь)
	
	Если Прочитать Тогда
		Прочитать();
	Иначе
		ОбновитьСтатусЗЕРНО(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПредставлениеОбработкаНавигационнойСсылкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВопроса = КодВозвратаДиалога.Да Тогда
		 Возврат;
	КонецЕсли;
	
	Если ПроверитьЗаполнение() Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		РазблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	Если Не Модифицированность И Объект.Проведен Тогда
		ОбработатьНажатиеНавигационнойСсылки(ДополнительныеПараметры.НавигационнаяСсылкаФорматированнойСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНажатиеНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПередатьДанные" Тогда
		
		ПараметрыПередачи = ИнтеграцияЗЕРНОСлужебныйКлиентСервер.ПараметрыОбработкиСообщений();
		ПараметрыПередачи.Ссылка        = Объект.Ссылка;
		ПараметрыПередачи.Организация   = Объект.Организация;
		ПараметрыПередачи.Подразделение = Объект.Подразделение;
		
		ОписаниеПриЗавершении = Новый ОписаниеОповещения(
			"Подключаемый_ПриЗавершенииОперации", ЭтотОбъект, ПараметрыПередачи);
		
		ИнтеграцияЗЕРНОКлиент.ПодготовитьКПередаче(ЭтотОбъект, ПараметрыПередачи, ОписаниеПриЗавершении);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтменитьОперацию" Тогда
		
		ИнтеграцияЗЕРНОКлиент.ОтменитьПоследнююОперацию(Объект.Ссылка);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтменитьПередачуДанных" Тогда
		
		ИнтеграцияЗЕРНОКлиент.ОтменитьПередачу(Объект.Ссылка);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПоказатьПричинуОшибки" Тогда
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Документ", Объект.Ссылка);
		
		ОткрытьФорму(
			"Справочник.ЗЕРНОПрисоединенныеФайлы.Форма.ФормаОшибки",
			ПараметрыОткрытияФормы,
			ЭтотОбъект);
	
	КонецЕсли;
	
КонецПроцедуры

#Область Статус

&НаСервере
Процедура ОбновитьЗаписатьПараметрыОбновленияСтатуса(Отказ, ТекущийОбъект)
	
	Если ПараметрыОбновленияСтатуса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СтатусыОбъектовСинхронизацииЗЕРНО.ОбновитьСтатус(
		ТекущийОбъект.Ссылка,
		ПараметрыОбновленияСтатуса);
	
	ПараметрыОбновленияСтатуса = Неопределено;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСтатусЗЕРНО(Форма, УстановитьПараметрыОбновленияСтатуса = Ложь)
	
	Объект = Форма.Объект;
	
	ПараметрыСтатуса = ПараметрыСтатусаДокумента(Объект);
	
	Форма.СтатусЗЕРНО = ПараметрыСтатуса.СтатусЗЕРНО;
	Форма.СтатусЗЕРНОПредставление = ПараметрыСтатуса.СтатусЗЕРНОПредставление;
	Форма.РедактированиеФормыНеДоступно = ПараметрыСтатуса.РедактированиеФормыНеДоступно;
	
	НастроитьЗависимыеЭлементыФормы(Форма, "СтатусЗЕРНО");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыСтатусаДокумента(ДокументОбъект)
	
	Результат = Новый Структура;
	Результат.Вставить("СтатусЗЕРНО");
	Результат.Вставить("СтатусЗЕРНОПредставление");
	Результат.Вставить("РедактированиеФормыНеДоступно", Ложь);
	
	Ссылка = ДокументОбъект.Ссылка;
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка);
	
	СтатусЗЕРНО        = МенеджерОбъекта.СтатусПоУмолчанию();
	ДальнейшееДействие = МенеджерОбъекта.ДальнейшееДействиеПоУмолчанию();
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Статусы.Статус КАК Статус,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие1 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюЗЕРНО.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие1
		|	КОНЕЦ КАК ДальнейшееДействие1,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие2 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюЗЕРНО.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие2
		|	КОНЕЦ КАК ДальнейшееДействие2,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие3 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюЗЕРНО.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие3
		|	КОНЕЦ КАК ДальнейшееДействие3
		|ИЗ
		|	РегистрСведений.СтатусыОбъектовСинхронизацииЗЕРНО КАК Статусы
		|ГДЕ
		|	Статусы.ОбъектСинхронизации = &Документ");
		
		Запрос.УстановитьПараметр("Документ",                 Ссылка);
		Запрос.УстановитьПараметр("МассивДальнейшиеДействия", ИнтеграцияЗЕРНО.НеотображаемыеВДокументахДальнейшиеДействия());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			СтатусЗЕРНО = Выборка.Статус;
			
			ДальнейшееДействие = Новый Массив;
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие1);
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие2);
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие3);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДопустимыеДействия = Новый Массив;
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияПоВзаимодействиюЗЕРНО.ПередайтеДанные);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияПоВзаимодействиюЗЕРНО.ОтменитеОперацию);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияПоВзаимодействиюЗЕРНО.ОтменитеПередачуДанных);
	
	СтатусЗЕРНОПредставление = ИнтеграцияЗЕРНО.ПредставлениеСтатуса(СтатусЗЕРНО, ДальнейшееДействие, ДопустимыеДействия);
	
	РедактированиеФормыНеДоступно = СтатусЗЕРНО <> Перечисления.СтатусыОбработкиЗапросаОстатковПартийЗЕРНО.Черновик;
	
	Результат.СтатусЗЕРНО                   = СтатусЗЕРНО;
	Результат.СтатусЗЕРНОПредставление      = СтатусЗЕРНОПредставление;
	Результат.РедактированиеФормыНеДоступно = РедактированиеФормыНеДоступно;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ИнициализироватьСлужебныеРеквизитыТаблицыОстаткиПоДаннымЗЕРНО()
	
	ИнтеграцияИСПереопределяемый.ЗаполнитьСлужебныеРеквизитыВКоллекции(ЭтотОбъект, Объект.ОстаткиПоДаннымЗЕРНО);
	
	КодыОКПД2 = Новый Массив;
	//@skip-warning
	ОКПД2ПоПартиям = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		Объект.ОстаткиПоДаннымЗЕРНО.Выгрузить().ВыгрузитьКолонку("Партия"),
		"ОКПД2");
	Для Каждого КлючИЗначение Из ОКПД2ПоПартиям Цикл
		КодыОКПД2.Добавить(КлючИЗначение.Значение);
	КонецЦикла;
	ТаблицаОКПД2 = ИнтеграцияЗЕРНО.НаименованияКодовОКПД2ПоТабличнойЧасти(КодыОКПД2);
	Для Каждого ТекущаяСтрока Из Объект.ОстаткиПоДаннымЗЕРНО Цикл
		
		ДанныеСтроки = ОКПД2ПоПартиям.Получить(ТекущаяСтрока.Партия);
		Если ДанныеСтроки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДанныеОКПД2 = ТаблицаОКПД2.Найти(ДанныеСтроки);
		Если ДанныеОКПД2 <> Неопределено Тогда
			ТекущаяСтрока.ОКПД2Представление = ИнтеграцияЗЕРНОКлиентСервер.ПредставлениеОКПД2(
				ДанныеОКПД2.Наименование, ДанныеОКПД2.Идентификатор);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоРасхождениямНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.ЗаполнитьПоРасхождениям();
	
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ВыполнитьОбменОбработкаОжидания()
	
	ИнтеграцияЗЕРНОСлужебныйКлиент.ПродолжитьВыполнениеОбмена(ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура НеСниматьРезервыСервер()
	Для Каждого СтрокаТЧ Из Объект.КорректировкаОстатков Цикл
		СтрокаТЧ.ВОбработкеЗЕРНО = 0;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОпределитьТипОрганизацияКонтрагент(ТипВладельца, ОрганизацияКонтрагент)
	
	ТипВладельца = ИнтеграцияЗЕРНО.ОпределитьТипОрганизацияКонтрагент(ОрганизацияКонтрагент);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПодсказкуВводаВладелецПартии(Форма)
	Форма.Элементы.ВладелецПартииСтрокой.ПодсказкаВвода = Строка(Форма.Объект.Организация);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПодсказкуВводаПодразделения(Форма)
	
	Если Форма.ПодразделенияИспользуются Тогда
		Если ЗначениеЗаполнено(Форма.Объект.ВладелецПартии) Тогда
			Форма.Элементы.ПодразделениеВладельцаПартии.ПодсказкаВвода = "";
		Иначе
			Форма.Элементы.ПодразделениеВладельцаПартии.ПодсказкаВвода = Строка(Форма.Объект.Подразделение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область РаботаСПолямимСоставногоТипа

&НаСервереБезКонтекста
Функция ИменаЭлементовПолейСоставногоТипа()
	
	Возврат "ВладелецПартииСтрокой, ЭлеваторСтрокой";
	
КонецФункции

&НаКлиенте
Процедура ПолеСоставногоТипаОкончаниеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	СобытияФормИСКлиент.ПолеСоставногоТипаОкончаниеВыбора(ЭтотОбъект, Результат, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеСоставногоТипаПриИзменении(Элемент)
	
	СобытияФормИСКлиент.ПолеСоставногоТипаПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеСоставногоТипаОткрытие(Элемент, СтандартнаяОбработка)
	
	СобытияФормИСКлиент.ПолеСоставногоТипаОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеСоставногоТипаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СобытияФормИСКлиент.ПолеСоставногоТипаОбработкаВыбора(ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеСоставногоТипаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СобытияФормИСКлиент.ПолеСоставногоТипаАвтоПодбор(ЭтотОбъект,
		Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
